{
    "home": {
        "content": "You wake up, and the first thing to do for the day is get your daily dose of exercise. However, you notice that your alarm didn’t go off at the appropriate time. Therefore, you are running late. Now, are you driving or is the car driving?", 
        "decisions" : [
            "Drive Manually?", 
            "Allow car to drive?"], 
        "links": ["a_gym_self", "a_gym_car"]},
    
    "a_gym_car": {
        "content": "you arrive on time, but you are 30 minutes late to the gym. You decide to cut your time at the gym, so timewise for the next task you are okay. You are now going to school. You forgot a required textbook at home, so you dash over there to pick it up. Now, you have to get to school from home. If you autodrive, you may arrive late and have to autopark.", 
        "decisions" : [
            "Drive Manually?", 
            "Allow car to drive?"], 
        "links": ["a_school_self_park", "a_school_autopark"]
    },
    "a_gym_self":{
        "content": " you arrive on time, but a speed camera catches you, and you are fined. You decide to cut your time at the gym, so timewise for the next task you are okay. You are now going to school. You forgot a required textbook at home, so you dash over there to pick it up. Now, you have to get to school from home. If you autodrive, you may arrive late and have to autopark.", 
        "decisions" : [
            "Drive Manually?", 
            "Allow car to drive?"], 
        "links": ["a_school_autopark", "a_school_autopark"]
    },
    "a_school_autopark":{
        "content": "You arrive late and had to autopark. You have to now pick up yoursiblings from school.", 
        "decisions" : [
            "Drive Manually?", 
            "Allow car to drive?"], 
        "links": ["a_sibling_late","a_sibling_less_late"]
    },
    "a_school_self_park":{
        "content": "You make it in time and you manually park. You have to pick your younger sibling from school", 
        "decisions" : [
            "Drive Manually?", 
            "Allow car to drive?"], 
        "links": ["a_sibling_ontime, a_sibling_ontime"]
    },
    
    "a_sibling_ontime":{
        "content": "You have picked up your sibling on time. You now have to go grocery shopping! You arrived. Do you want to double park or autopark?", 
        "decisions" : [
            "Double park", 
            "Autopark"], 
        "links": ["a_missing_items","a_success_items"]
    },
    "a_sibling_less_late":{
        "content": "You have arrived a little late making your siblings wait for a small while. Now you have to go grocery shopping. You have arrived. Do you want to double park or autopark?", 
        "decisions" : [
            "Double Park?", 
            "Autopark?"], 
        "links": ["a_missing_items","a_success_items"]
    },
    "a_sibling_late":{
        "content": "You have made it to the school right in time for dismissal. But you have sped, and couldn’t slow down in time for a speed bump located in the school zone. You see a parent and child crossing and couldn't stop. Because of negligent driving, the parent and child have died. Game over!!!", 
        "decisions" : [], 
        "links": []
    },
    "a_missing_items":{
        "content": "Since you double parked, you ended up rushing and then ended up missing several items unfortunately. Now, you get to your friend’s party where it takes about 20 minutes from your place and park safely. You take a couple of shots and smoke weed. Party is over at 1 am in the morning, and you are in the middle of Manhattan city. Time to go back home. You know you cannot drive for sure. Here, you can choose two options: 1. You know a shortcut that hasn’t been programmed into the car yet for autodrive. If you take this, you avoid the toll you have to pay and avoid the booth which contains police. 2. You let the car drive, which takes a bridge that has a toll.", 
        "decisions" : ["Drive Manually?", 
            "Allow car to drive?"], 
        "links": ["a_crash", "a_money"]
    },

    "a_success_items":{
        "content": "Since you autoparked, you didn't have to rush and successfully bought all the food items. Now, you get to your friend’s party where it takes about 20 minutes from your place and park safely. You take a couple of shots and smoke weed. Party is over at 1 am in the morning, and you are in the middle of Manhattan city. Time to go back home. You know you cannot drive for sure. Here, you can choose two options: 1. You know a shortcut that hasn’t been programmed into the car yet for autodrive. If you take this, you avoid the toll you have to pay and avoid the booth which contains police. 2. You let the car drive, which takes a bridge that has a toll.", 
        "decisions" : ["Drive Manually?", 
                       "Allow car to drive?"], 
        "links": ["a_crash", "a_money"]
    },

    "a_crash":{
        "content": "You crash into a lamppost. But no major injuries are acquired. However, your headlight has been completely damaged, so you have to repair that in the future.", 
        "decisions" : [], 
        "links": []
    },
    "a_money":{
        "content": "You pay the toll and the fine for driving drunk even on autodrive (let’s make this less than the fine for drunk driving manually).", 
        "decisions" : [], 
        "links": []
    },
    


    
    "b_gym": {
        "content": "You’re going to the gym at 9am and there is a traffic jam. Do you try to cut in front of the other vehicles or wait in traffic?", 
        "decisions": ["Cut in front of the vehicles", "Be safe and wait for the traffic"],
        "links": ["b_gym_1", "b_gym_2"]},

    "b_gym_1" : {
        
    },

    "b_gym_2" : {

    },
    
    "b_school": {"content": "Going back to school at 12pm, there is still a bit of traffic. However, you know a shortcut through a field that can get past the most congested part of the road. This field is muddy and you have a chance of getting stuck, damaging the car, or hurting yourself but you have done it a few times before and the worst that happened was a flat tire. However, the field is also private property and you have been warned last time by the angry owner to never trespass again. If you decide to cross...almost get stuck, but make it through fine. However, the owner of the land sees and calls the police on you. You can argue with the police that the route was set automatically by the car If you do not cross... you miss half of your class but get there with no police on your trail.", 
        "decisions": ["Take shortcut to save time",  "Follow the law and stay on the road"],
        "links": ["b_school_1", "b_school_2"]},
    
    "b_school_1" : {},

    "b_school_2" : {},
    
    "b_sibling": {"content": "Your younger sibling goes to middle school across the city. You need to pick him up at 3pm and bring him back home. You arrive at his school with no problems, but after you pick up your sibling and head back home, you see a car rush toward you at an intersection. You remembered that you programmed the car before, choosing from one of two options. Protect the passengers at all cost or minimize the total damage of living beings within a 20m radius.", "links": []},
    "decisions": {"sibling_decision_b1" : "Protect passengers at all costs", "sibling_decision_b2" : "Minimize the damage of all humans in a 20m radius"},
    "links": [],
   
    "b_grocery": {"content": "You need to go grocery shopping at 4pm. The place you usually park near the grocery market is on road construction. So, you have to find another place to park as soon as possible otherwise you will get back home late and have no time to cook for your younger sibling because you are planning to go to your friend’s party after dinner. You can pick two options that you do not have to be in the car while you are grocery shopping: 1. Letting the car find a parking spot by itself and park; 2. Letting the car drive around the grocery store while you are in the market.",
        "decisions": {"grocery_decision_b1" : "Let your car look for a space to park", "grocery_decision_b2" : "Let your car driving itself"},
        "links": []},
    
    "b_party": { 
        "content": "You get to your friend’s party where it takes about 20 minutes from your place and park safely. You take a couple of shots and smoke weed. Party is over at 1am in the morning, and you are in the middle of Manhattan city. Time to go back home. You know you cannot drive for sure. Here, you can choose two options: 1. You let the car drive by itself to get home and park automatically, but you know this is illegal even though you are not driving; 2. You can ask one of your friends who did not drink at all, but he just got a his driving license a week ago.", 
        "decisions": {"party_decision_b1" : "Let your car drive to home automatically", "party_decision_b2" : "Ask your friend to drive to you place"},
        "links": []},
 
    "template" : {"decision": "", "links": []}
    
}